/* *************************************************************************
 * NAME : dbo.UDP_JCA_AP_REPORT_RIVAL_SEL
 * TYPE : PROCEDURE (SQL_STORED_PROCEDURE)
 * TIME : Create: 2009-10-15 15:19:50.453
 *        Modify: 2018-05-03 17:23:34.573
 *        Backup: 20180521_1737
 ************************************************************************* */

CREATE PROC [dbo].[UDP_JCA_AP_REPORT_RIVAL_SEL]
	@YYYY		CHAR(4)
AS
	SET NOCOUNT ON
	SET TRANSACTION ISOLATION LEVEL  READ UNCOMMITTED
	-- ----------------------------------------------------------------------------------
	-- 작성자 : WOOKKI25 / 2008.10.15
	-- 설  명 : 경쟁사 GMV 입력 - 경쟁사 동향 파악
	-- 실  행 : UDP_JCA_AP_DATA_INS_FEE 536, 2008, 11, 6, 8900
	-- ----------------------------------------------------------------------------------
	
	-- ----------------------------------------------------------------------------------
	-- 수정내역
	-- ----------------------------------------------------------------------------------
	/*
	수정일:			수정자:			수정내용:
	----------		-----------		-----------------------------------------------------		
	*/
	SELECT	YYYYMM
	,		ENURI_GMV
	,		NAVER_GMV
	,		DANAWA_GMV
	,		100/(ENURI_GMV) AS GMV_RATIO
	FROM	TBL_JCA_RIVAL_GMV
	WHERE	YYYYMM LIKE @YYYY+'%'	
	ORDER BY 1
