/* *************************************************************************
 * NAME : dbo.udp_jca_ap_report_sponsor_shop_sel
 * TYPE : PROCEDURE (SQL_STORED_PROCEDURE)
 * TIME : Create: 2010-08-13 17:49:22.33
 *        Modify: 2018-05-03 17:23:35.89
 *        Backup: 20180521_1739
 ************************************************************************* */

CREATE proc [dbo].[udp_jca_ap_report_sponsor_shop_sel]
as
	set nocount on
	set transaction isolation level  read uncommitted
	-- ----------------------------------------------------------------------------------
	-- 작성자 : wookki25 / 2008.03.18
	-- 설  명 : ap 업체목록
	-- 실  행 : udp_jca_ap_report_shop_list_ad
	-- ----------------------------------------------------------------------------------
	
	-- ----------------------------------------------------------------------------------
	-- 수정내역
	-- ----------------------------------------------------------------------------------
	/*
	수정일:			수정자:			수정내용:
	----------		-----------		-----------------------------------------------------		
	*/
	select	shop_vcode, shop_name 
	from	shoplist
	where	--shop_vcode = 5892
			shop_apflag = '5'
	--and		shop_service = '0'
	order by shop_name
