/* *************************************************************************
 * NAME : dbo.udp_group_cate_del
 * TYPE : PROCEDURE (SQL_STORED_PROCEDURE)
 * TIME : Create: 2010-04-26 16:35:47.9
 *        Modify: 2018-05-03 17:23:34.943
 *        Backup: 20180521_1739
 ************************************************************************* */

CREATE PROC udp_group_cate_del
	@gc_seq int
AS 
	SET NOCOUNT ON 
	SET TRANSACTION ISOLATION LEVEL READ UNCOMMITTED
	-- ----------------------------------------------
	-- 작성자 : 그룹 적용 분류 del / 2010-04-26
	-- 설  명 : wookki25
	-- ----------------------------------------------
	-- ----------------------------------------------
	-- 수정내역
	-- ----------------------------------------------
	/* 
	수정일:			수정자:			수정내용:
	-------------------------------------------------
	*/
	
	delete from tbl_group_cate where gc_seq = @gc_seq
